suntyrael/ESP32S3_GPS_Codex/sdkconfig.defaults
# ESP32-S3FH4R2 构建基线配置（C-04：sdkconfig.defaults 入库，sdkconfig 不入库）
CONFIG_IDF_TARGET="esp32s3"

# Flash / PSRAM（FH4R2：4MB flash + 2MB PSRAM，四线模式）
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
# 注意：禁止 CONFIG_SPIRAM_MODE_OCT（会占用 GPIO33~37 与 SD 冲突，README §3.3-2）

# 分区：单 App 大分区（预留 ≥30% 余量）
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# 控制台：UART0 主调试口 + USB-Serial-JTAG 副口（USB-CDC 升级+串口）
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# 日志级别
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# 任务看门狗（默认开启；传感器任务周期轮询可喂）
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
